---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution
source: html/a2577c95-5d70-7c98-a083-1feb1d4da99e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution Property

"Analytical Surface Resolution"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution { get; }
```